practice/aaa_app/app/controllers/game_controller.rb

 def create
 	game = Game.new(game_params)
 	game.save
---
INSERT INTO "games" ("name", "weapon", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "グラン"], ["weapon", "全種類"], ["category", "全属性（公式だと風）"], ["created_at", "2020-08-13 12:22:39.814121"], ["updated_at", "2020-08-13 12:22:39.814121"]]

 def index
 	@game = Game.all
---
SELECT "games".* FROM "games"

 def update
 	game = Game.find(params[:id])
 	game.update(game_params)
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "games" SET "image_id" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["image_id", "12caf34b4e59c58c14817da00a9ee34d826eeae091ebc1d0efb881bf0f72"], ["updated_at", "2020-08-14 13:59:52.802200"], ["id", 1]]

 def destroy
 	game = Game.find(params[:id])
 	game.destroy
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 4]]