practice/aaa_app/app/controllers/grass_controller.rb

  def create
  	grass = Grass.new(grass_params)
  	grass.save
---
INSERT INTO "grasses" ("title", "english_name", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "サンセベリア"], ["english_name", ""], ["date", ""], ["created_at", "2020-08-15 13:42:03.853946"], ["updated_at", "2020-08-15 13:42:03.853946"]]

  def index
    @grasses = Grass.all
---
SELECT "grasses".* FROM "grasses"

  def show
    @grass =Grass.find(params[:id])
---
SELECT  "grasses".* FROM "grasses" WHERE "grasses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @grass = Grass.find(params[:id])
---
SELECT  "grasses".* FROM "grasses" WHERE "grasses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    grass = Grass.find(params[:id])
    grass.update(grass_params)
---
SELECT  "grasses".* FROM "grasses" WHERE "grasses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "grasses" SET "english_name" = ?, "updated_at" = ? WHERE "grasses"."id" = ?  [["english_name", "Sansevieria"], ["updated_at", "2020-08-15 15:05:06.721505"], ["id", 1]]