practice/aaa_app/app/controllers/todolists_controller.rb

  def create
  	list = List.new(list_params)
  	list.save
---
INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hello"], ["body", "hello,world"], ["created_at", "2020-08-12 10:25:33.341389"], ["updated_at", "2020-08-12 10:25:33.341389"]]

  def update
    list = List.find(params[:id])
    list.update(list_params)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "lists" SET "title" = ?, "image_id" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["title", "投稿フォーム作成"], ["image_id", "a91997fe768935ac76e23edaff0719f487ec548a8c2a3e27b80397e0343f"], ["updated_at", "2020-08-14 12:15:50.984007"], ["id", 3]]